{
    "Atom": "The basic unit of a chemical element.",
    "Binary": "A system of numerical notation that has 2 as a base.",
    "Canopy": "The uppermost layer of a forest formed by tree crowns.",
    "Dynasty": "A line of hereditary rulers of a country.",
    "Euphoria": "A feeling or state of intense excitement and happiness.",
    "Fusion": "The process of merging two or more entities into one.",
    "Galaxy": "A vast system of stars, dust, and gas bound by gravity.",
    "Habitat": "The natural environment in which an organism lives.",
    "Innovation": "The introduction of new ideas or methods.",
    "Jungle": "A dense forest in a tropical climate.",
    "Kinetic": "Related to or resulting from motion.",
    "Longitude": "The angular distance of a place east or west of the prime meridian.",
    "Metaphor": "A figure of speech in which a word is applied to an object it does not literally belong to.",
    "Nebula": "A cloud of gas and dust in outer space.",
    "Oxygen": "A chemical element essential for life on Earth.",
    "Photosynthesis": "The process used by plants to convert light into energy.",
    "Quantum": "The minimum amount of any physical entity involved in an interaction.",
    "Relativity": "A theory by Einstein explaining space, time, and gravity.",
    "Symbiosis": "A close relationship between two different organisms.",
    "Terraform": "To modify a planet to support life like Earth.",
    "Umbra": "The fully shaded inner region of a shadow.",
    "Vortex": "A mass of whirling fluid or air.",
    "Wavelength": "The distance between successive crests of a wave.",
    "Xenon": "A chemical element used in specialized lamps.",
    "Yield": "To produce or provide something.",
    "Zenith": "The highest point reached in the sky by a celestial object.",
    "Algorithm": "A step-by-step procedure for solving a problem or performing a task.",
    "Blockchain": "A decentralized digital ledger used in cryptocurrency transactions.",
    "Catalyst": "A substance that speeds up a chemical reaction without being consumed.",
    "Dendrite": "A branch-like structure in neurons that receives signals.",
    "Eclipse": "An event where one celestial body moves into the shadow of another.",
    "Fractal": "A complex geometric pattern that repeats at different scales.",
    "Genomics": "The study of an organism's complete set of DNA, including its genes.",
    "Hydrology": "The scientific study of water movement, distribution, and quality.",
    "Inertia": "A property of matter that resists changes in motion.",
    "Joule": "A unit of energy in the International System of Units (SI).",
    "Keystone": "A central, supporting element in an arch or system.",
    "Lattice": "A repeating arrangement of atoms, ions, or molecules in a crystal.",
    "Momentum": "The quantity of motion an object has, dependent on mass and velocity.",
    "Neuron": "A nerve cell that transmits electrical and chemical signals in the body.",
    "Oscillation": "A repetitive variation in position, magnitude, or state over time.",
    "Photon": "A quantum of light or other electromagnetic radiation.",
    "Quasar": "A distant, extremely bright celestial object powered by a black hole.",
    "Resonance": "A phenomenon where a system vibrates at a specific frequency.",
    "Supernova": "A powerful stellar explosion that occurs at the end of a star’s lifecycle.",
    "Turbulence": "Irregular or chaotic fluid motion, often seen in air and water currents.",
    "Uranium": "A radioactive element used as fuel in nuclear reactors.",
    "Xylem": "A type of tissue in plants that transports water from roots to leaves.",
    "Yield Strength": "The stress at which a material begins to deform permanently.",
    "Aerosol": "A suspension of fine solid particles or liquid droplets in air or another gas.",
    "Buoyancy": "The ability of an object to float in a fluid due to upward force.",
    "Cryosphere": "The frozen water part of the Earth system, including ice caps and glaciers.",
    "Diffraction": "The bending of waves around obstacles or through openings.",
    "Entropy": "A measure of disorder or randomness in a system.",
    "Fibonacci": "A sequence in which each number is the sum of the two preceding ones.",
    "Glucose": "A simple sugar that serves as a primary energy source for living organisms.",
    "Holography": "A technique to create three-dimensional images using laser light.",
    "Igneous": "A type of rock formed from the solidification of molten lava or magma.",
    "Jigsaw": "A puzzle in which interlocking pieces form a picture when assembled.",
    "Kilobyte": "A unit of digital information storage equal to 1024 bytes.",
    "Lithosphere": "The rigid outer layer of the Earth, consisting of the crust and upper mantle.",
    "Magnetism": "A physical phenomenon produced by the motion of electric charges.",
    "Nucleotide": "The basic structural unit of DNA and RNA.",
    "Optics": "The branch of physics concerned with light and vision.",
    "Polymorphism": "The ability of an object or function to take on different forms in programming.",
    "Quintessence": "The most perfect or typical example of a quality or class.",
    "Radiation": "The emission of energy as electromagnetic waves or particles.",
    "Semiconductor": "A material with conductivity between conductors and insulators, used in electronics.",
    "Tectonics": "The study of Earth's structural features and movements.",
    "Ultraviolet": "A type of electromagnetic radiation with a wavelength shorter than visible light.",
    "Viscosity": "A measure of a fluid’s resistance to flow.",
    "Ytterbium": "A chemical element used in lasers and nuclear applications.",
    "Zygote": "A fertilized cell formed by the union of sperm and egg."
}
